dunknowcoding/NiusBurner/niusburner/arduino/pic16/boards.txt
# NiusBurner pic16 boards.
#
# Copyright 2026 dunknowcoding (NiusRobotLab)
# SPDX-License-Identifier: Apache-2.0
#
# Generated from niusburner/boards.json by `python -m niusburner setup`.
# Edit the catalog, not this file.
#
# Defaults are the safe answer, not the fastest one: Size, because
# these parts run out of room long before cycles;
# because symbols cost build time and disk rather than flash; and
# auto-detection, because a compiler is normally where its own
# installer put it.

menu.optimize=Optimize
menu.compiler=Compiler

# ----------------------------------------------------------------------
# 1 K words, 8-pin, internal 4 MHz oscillator. One port, called GPIO. No USART and no converter.
pic12f629.name=12F629 (1 K words, PICkit 3) [experimental]
pic12f629.upload.tool=niusburner
pic12f629.upload.protocol=pickit3
pic12f629.upload.maximum_size=1024
pic12f629.upload.maximum_data_size=64
pic12f629.upload.require_upload_port=false
pic12f629.build.mcu=12F629
pic12f629.build.f_cpu=4000000L
pic12f629.build.board=12F629
pic12f629.build.core=niusburner
pic12f629.build.variant=standard
pic12f629.build.nb_board=pic12f629
pic12f629.build.extra_flags=

pic12f629.menu.optimize.size=Size (default)
pic12f629.menu.optimize.size.build.nb_optimize=size
pic12f629.menu.optimize.speed=Speed
pic12f629.menu.optimize.speed.build.nb_optimize=speed
pic12f629.menu.optimize.none=None
pic12f629.menu.optimize.none.build.nb_optimize=none

pic12f629.menu.compiler.auto=Auto-detect SDCC (default)
pic12f629.menu.compiler.auto.build.nb_compiler=auto
pic12f629.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic12f629.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 1 K words, 8-pin, internal 4 MHz oscillator. One port, called GPIO. No USART.
pic12f675.name=12F675 (1 K words, PICkit 3) [experimental]
pic12f675.upload.tool=niusburner
pic12f675.upload.protocol=pickit3
pic12f675.upload.maximum_size=1024
pic12f675.upload.maximum_data_size=64
pic12f675.upload.require_upload_port=false
pic12f675.build.mcu=12F675
pic12f675.build.f_cpu=4000000L
pic12f675.build.board=12F675
pic12f675.build.core=niusburner
pic12f675.build.variant=standard
pic12f675.build.nb_board=pic12f675
pic12f675.build.extra_flags=

pic12f675.menu.optimize.size=Size (default)
pic12f675.menu.optimize.size.build.nb_optimize=size
pic12f675.menu.optimize.speed=Speed
pic12f675.menu.optimize.speed.build.nb_optimize=speed
pic12f675.menu.optimize.none=None
pic12f675.menu.optimize.none.build.nb_optimize=none

pic12f675.menu.compiler.auto=Auto-detect SDCC (default)
pic12f675.menu.compiler.auto.build.nb_compiler=auto
pic12f675.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic12f675.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 2 K words, 8-pin, internal oscillator. One port, called GPIO. No USART.
pic12f683.name=12F683 (2 K words, PICkit 3) [experimental]
pic12f683.upload.tool=niusburner
pic12f683.upload.protocol=pickit3
pic12f683.upload.maximum_size=2048
pic12f683.upload.maximum_data_size=128
pic12f683.upload.require_upload_port=false
pic12f683.build.mcu=12F683
pic12f683.build.f_cpu=4000000L
pic12f683.build.board=12F683
pic12f683.build.core=niusburner
pic12f683.build.variant=standard
pic12f683.build.nb_board=pic12f683
pic12f683.build.extra_flags=

pic12f683.menu.optimize.size=Size (default)
pic12f683.menu.optimize.size.build.nb_optimize=size
pic12f683.menu.optimize.speed=Speed
pic12f683.menu.optimize.speed.build.nb_optimize=speed
pic12f683.menu.optimize.none=None
pic12f683.menu.optimize.none.build.nb_optimize=none

pic12f683.menu.compiler.auto=Auto-detect SDCC (default)
pic12f683.menu.compiler.auto.build.nb_compiler=auto
pic12f683.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic12f683.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 1 K words, 18-pin, USART, comparators.
pic16f627a.name=16F627A (1 K words, PICkit 3) [experimental]
pic16f627a.upload.tool=niusburner
pic16f627a.upload.protocol=pickit3
pic16f627a.upload.maximum_size=1024
pic16f627a.upload.maximum_data_size=224
pic16f627a.upload.require_upload_port=false
pic16f627a.build.mcu=16F627A
pic16f627a.build.f_cpu=20000000L
pic16f627a.build.board=16F627A
pic16f627a.build.core=niusburner
pic16f627a.build.variant=standard
pic16f627a.build.nb_board=pic16f627a
pic16f627a.build.extra_flags=

pic16f627a.menu.optimize.size=Size (default)
pic16f627a.menu.optimize.size.build.nb_optimize=size
pic16f627a.menu.optimize.speed=Speed
pic16f627a.menu.optimize.speed.build.nb_optimize=speed
pic16f627a.menu.optimize.none=None
pic16f627a.menu.optimize.none.build.nb_optimize=none

pic16f627a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f627a.menu.compiler.auto.build.nb_compiler=auto
pic16f627a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f627a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 2 K words, 18-pin, USART, comparators.
pic16f628a.name=16F628A (2 K words, PICkit 3) [experimental]
pic16f628a.upload.tool=niusburner
pic16f628a.upload.protocol=pickit3
pic16f628a.upload.maximum_size=2048
pic16f628a.upload.maximum_data_size=224
pic16f628a.upload.require_upload_port=false
pic16f628a.build.mcu=16F628A
pic16f628a.build.f_cpu=20000000L
pic16f628a.build.board=16F628A
pic16f628a.build.core=niusburner
pic16f628a.build.variant=standard
pic16f628a.build.nb_board=pic16f628a
pic16f628a.build.extra_flags=

pic16f628a.menu.optimize.size=Size (default)
pic16f628a.menu.optimize.size.build.nb_optimize=size
pic16f628a.menu.optimize.speed=Speed
pic16f628a.menu.optimize.speed.build.nb_optimize=speed
pic16f628a.menu.optimize.none=None
pic16f628a.menu.optimize.none.build.nb_optimize=none

pic16f628a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f628a.menu.compiler.auto.build.nb_compiler=auto
pic16f628a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f628a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words, 18-pin, USART, comparators.
pic16f648a.name=16F648A (4 K words, PICkit 3) [experimental]
pic16f648a.upload.tool=niusburner
pic16f648a.upload.protocol=pickit3
pic16f648a.upload.maximum_size=4096
pic16f648a.upload.maximum_data_size=256
pic16f648a.upload.require_upload_port=false
pic16f648a.build.mcu=16F648A
pic16f648a.build.f_cpu=20000000L
pic16f648a.build.board=16F648A
pic16f648a.build.core=niusburner
pic16f648a.build.variant=standard
pic16f648a.build.nb_board=pic16f648a
pic16f648a.build.extra_flags=

pic16f648a.menu.optimize.size=Size (default)
pic16f648a.menu.optimize.size.build.nb_optimize=size
pic16f648a.menu.optimize.speed=Speed
pic16f648a.menu.optimize.speed.build.nb_optimize=speed
pic16f648a.menu.optimize.none=None
pic16f648a.menu.optimize.none.build.nb_optimize=none

