dunknowcoding/NiusBurner/niusburner/arduino/pic16/boards.txt
pic16f648a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f648a.menu.compiler.auto.build.nb_compiler=auto
pic16f648a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f648a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 1 K words, 18-pin, no USART and no analog.
pic16f84a.name=16F84A (1 K words, PICkit 3) [experimental]
pic16f84a.upload.tool=niusburner
pic16f84a.upload.protocol=pickit3
pic16f84a.upload.maximum_size=1024
pic16f84a.upload.maximum_data_size=68
pic16f84a.upload.require_upload_port=false
pic16f84a.build.mcu=16F84A
pic16f84a.build.f_cpu=20000000L
pic16f84a.build.board=16F84A
pic16f84a.build.core=niusburner
pic16f84a.build.variant=standard
pic16f84a.build.nb_board=pic16f84a
pic16f84a.build.extra_flags=

pic16f84a.menu.optimize.size=Size (default)
pic16f84a.menu.optimize.size.build.nb_optimize=size
pic16f84a.menu.optimize.speed=Speed
pic16f84a.menu.optimize.speed.build.nb_optimize=speed
pic16f84a.menu.optimize.none=None
pic16f84a.menu.optimize.none.build.nb_optimize=none

pic16f84a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f84a.menu.compiler.auto.build.nb_compiler=auto
pic16f84a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f84a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f873.name=16F873 (4 K words, PICkit 3) [experimental]
pic16f873.upload.tool=niusburner
pic16f873.upload.protocol=pickit3
pic16f873.upload.maximum_size=4096
pic16f873.upload.maximum_data_size=192
pic16f873.upload.require_upload_port=false
pic16f873.build.mcu=16F873
pic16f873.build.f_cpu=20000000L
pic16f873.build.board=16F873
pic16f873.build.core=niusburner
pic16f873.build.variant=standard
pic16f873.build.nb_board=pic16f873
pic16f873.build.extra_flags=

pic16f873.menu.optimize.size=Size (default)
pic16f873.menu.optimize.size.build.nb_optimize=size
pic16f873.menu.optimize.speed=Speed
pic16f873.menu.optimize.speed.build.nb_optimize=speed
pic16f873.menu.optimize.none=None
pic16f873.menu.optimize.none.build.nb_optimize=none

pic16f873.menu.compiler.auto=Auto-detect SDCC (default)
pic16f873.menu.compiler.auto.build.nb_compiler=auto
pic16f873.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f873.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f873a.name=16F873A (4 K words, PICkit 3)
pic16f873a.upload.tool=niusburner
pic16f873a.upload.protocol=pickit3
pic16f873a.upload.maximum_size=4096
pic16f873a.upload.maximum_data_size=192
pic16f873a.upload.require_upload_port=false
pic16f873a.build.mcu=16F873A
pic16f873a.build.f_cpu=20000000L
pic16f873a.build.board=16F873A
pic16f873a.build.core=niusburner
pic16f873a.build.variant=standard
pic16f873a.build.nb_board=pic16f873a
pic16f873a.build.extra_flags=

pic16f873a.menu.optimize.size=Size (default)
pic16f873a.menu.optimize.size.build.nb_optimize=size
pic16f873a.menu.optimize.speed=Speed
pic16f873a.menu.optimize.speed.build.nb_optimize=speed
pic16f873a.menu.optimize.none=None
pic16f873a.menu.optimize.none.build.nb_optimize=none

pic16f873a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f873a.menu.compiler.auto.build.nb_compiler=auto
pic16f873a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f873a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 40-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A.
pic16f874.name=16F874 (4 K words, PICkit 3) [experimental]
pic16f874.upload.tool=niusburner
pic16f874.upload.protocol=pickit3
pic16f874.upload.maximum_size=4096
pic16f874.upload.maximum_data_size=192
pic16f874.upload.require_upload_port=false
pic16f874.build.mcu=16F874
pic16f874.build.f_cpu=20000000L
pic16f874.build.board=16F874
pic16f874.build.core=niusburner
pic16f874.build.variant=standard
pic16f874.build.nb_board=pic16f874
pic16f874.build.extra_flags=

pic16f874.menu.optimize.size=Size (default)
pic16f874.menu.optimize.size.build.nb_optimize=size
pic16f874.menu.optimize.speed=Speed
pic16f874.menu.optimize.speed.build.nb_optimize=speed
pic16f874.menu.optimize.none=None
pic16f874.menu.optimize.none.build.nb_optimize=none

pic16f874.menu.compiler.auto=Auto-detect SDCC (default)
pic16f874.menu.compiler.auto.build.nb_compiler=auto
pic16f874.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f874.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 40-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A.
pic16f874a.name=16F874A (4 K words, PICkit 3)
pic16f874a.upload.tool=niusburner
pic16f874a.upload.protocol=pickit3
pic16f874a.upload.maximum_size=4096
pic16f874a.upload.maximum_data_size=192
pic16f874a.upload.require_upload_port=false
pic16f874a.build.mcu=16F874A
pic16f874a.build.f_cpu=20000000L
pic16f874a.build.board=16F874A
pic16f874a.build.core=niusburner
pic16f874a.build.variant=standard
pic16f874a.build.nb_board=pic16f874a
pic16f874a.build.extra_flags=

pic16f874a.menu.optimize.size=Size (default)
pic16f874a.menu.optimize.size.build.nb_optimize=size
pic16f874a.menu.optimize.speed=Speed
pic16f874a.menu.optimize.speed.build.nb_optimize=speed
pic16f874a.menu.optimize.none=None
pic16f874a.menu.optimize.none.build.nb_optimize=none

pic16f874a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f874a.menu.compiler.auto.build.nb_compiler=auto
pic16f874a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f874a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f876.name=16F876 (8 K words, PICkit 3) [experimental]
pic16f876.upload.tool=niusburner
pic16f876.upload.protocol=pickit3
pic16f876.upload.maximum_size=8192
pic16f876.upload.maximum_data_size=368
pic16f876.upload.require_upload_port=false
pic16f876.build.mcu=16F876
pic16f876.build.f_cpu=20000000L
pic16f876.build.board=16F876
pic16f876.build.core=niusburner
pic16f876.build.variant=standard
pic16f876.build.nb_board=pic16f876
pic16f876.build.extra_flags=

pic16f876.menu.optimize.size=Size (default)
pic16f876.menu.optimize.size.build.nb_optimize=size
pic16f876.menu.optimize.speed=Speed
pic16f876.menu.optimize.speed.build.nb_optimize=speed
pic16f876.menu.optimize.none=None
pic16f876.menu.optimize.none.build.nb_optimize=none

pic16f876.menu.compiler.auto=Auto-detect SDCC (default)
pic16f876.menu.compiler.auto.build.nb_compiler=auto
pic16f876.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f876.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f876a.name=16F876A (8 K words, PICkit 3)
pic16f876a.upload.tool=niusburner
pic16f876a.upload.protocol=pickit3
pic16f876a.upload.maximum_size=8192
pic16f876a.upload.maximum_data_size=368
pic16f876a.upload.require_upload_port=false
pic16f876a.build.mcu=16F876A
pic16f876a.build.f_cpu=20000000L
pic16f876a.build.board=16F876A
pic16f876a.build.core=niusburner
pic16f876a.build.variant=standard
pic16f876a.build.nb_board=pic16f876a
pic16f876a.build.extra_flags=

